tests/org.eclipse.datatools.enablement.oda.ws.test/test/org/eclipse/datatools/enablement/oda/ws/golden/WSDLAdvisorTest.testTemplate4.txt

<?xml version="1.0"?>
<SOAP-ENV:Envelope
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Body>
		<m:GetQuotes xmlns:m="http://swanandmokashi.com">
			<m:QuoteTicker xsi:type="xsd:string">&?QuoteTicker?&</m:QuoteTicker>
		</m:GetQuotes>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>